{"id": "54b2d74a653ef566a4f95802def0d6f556e7a4b7", "kind": "markdown", "created_time": null, "modified_time": null, "indexed_time": "2019-02-01 23:12:13.875950", "title": "README.md", "url": "https://github.com/dcppc/organize/blob/master/reporting/README.md", "mimetype": "", "owner_email": "", "owner_name": "", "group": "", "repo_name": "dcppc/organize", "repo_url": "https://github.com/dcppc/organize", "github_user": "", "issue_title": "", "issue_url": "", "content": "# Reporting Procedure for Phase 1\n\nSee [project management\noverview](https://github.com/dcppc/organize/blob/master/project-management/README.md)\nfor an overview of the project management system.\n\nThis is an overview of our monthly reporting process for the NIH Data\nCommons. We want to have a single SOP that we can all refer to in order\nto eliminate the ambiguity that is causing confusion in the project.\n\n1.  GitHub is our authoritative source for milestones and deliverable\n    status.\n    1.  See <https://github.com/dcppc>\n    2.  For milestones mapped to deliverables:\n        <https://github.com/dcppc/project-management>\n    3.  For milestone tickets:\n        <https://github.com/dcppc/dcppc-milestones>\n    4.  For deliverable tickets:\n        <https://github.com/dcppc/dcppc-deliverables>\n2.  Each funded team ensures their milestones to deliverables (demo)\n    mapping is complete and accurate on GitHub\n    (<https://github.com/dcppc/project-management/phase-1>)\n    1.  Some milestones may be predecessors for demos before the\n        milestone is 100% completed (in that case, the demo is simply\n        leveraging work in progress on those milestones and that's OK).\n    2.  See <https://github.com/dcppc/project-management> for the\n        milestones to deliverables (demos) maps for each of the teams\n3.  Monthly:\n    1.  By the last day of the month the team marks all milestones for\n        that month either started (using the ‘started’ label) or\n        finished (by closing the issue) in\n        <https://github.com/dcppc/dcppc-milestones>. Text is included\n        within the milestone to indicate what was done and this\n        corresponds to narrative text that’s typically found in\n        traditional reports (albeit more brief).\n    2.  By the last day of the month, KC leads will be responsible for\n        reviewing the milestones related to their KC. If a Team has a KC\n        lead, this is considered part of their reporting\n        responsibilities\n    3.  Team Copper will generate a report per team and per KC from the\n        milestones repos by the second business day of each month. This\n        report will show what milestones the team has worked on (or\n        completed), the demos/deliverables that have been accepted, and\n        will include the comments text per issue for context. Team\n        Copper will send this report to the coordinating PM per team for\n        approval by the Team and PIs. (Note, this report can be\n        regenerated easily by Team Copper in response to updated\n        milestones.)\n    4.  iv. Once approved, the team will send this finalized milestone\n        report directly to Teresa Marquette and Lora Kutkat. NIH does\n        not require that this report go through the awardees’\n        institutional business office. The milestone report (e.g., the\n        .csv file) takes the place of any previously required progress\n        reporting obligation, such as quarterly progress reports or long\n        narratives that historically were supplied to communicate\n        progress. (Financial quarterly reports are a separate process.)\n    5.  The due date is the 5th business day of the month for monthly\n        reports. See the [spreadsheet of\n        deadlines](https://docs.google.com/spreadsheets/d/1AHIahCZg63cbSH0Y-UbfH1RzlGvgGrmd5NXVe-zpWvc/edit#gid=0).\n    6.  Deliverables (products and demos) will follow a separate\n        workflow that involves a review process [documented\n        here](../product-demo-delivery/README.md). Briefly:\n        1.  By the last day of the month the delivering team will\n            coordinate with Team Copper to hand off demos and products\n            via a GitHub pull request. For demos, we encourage\n            persistent artifacts (see\n            [InternalDeliveryGuidelines](InternalDeliveryGuidelines.md)\n            for more information) that can be reviewed by others.\n        2.  Deliverables will undergo a level of review and be added to\n            the internal (access-controlled) Web site available to the\n            entire Consortium; see the [internal list of delivered\n            products and\n            demos](https://github.com/dcppc/internal/blob/master/phase-1/index.md).\n    7.  When the monthly report has been accepted by NIH, Teresa tends\n        to let your business office know but not always. On the rare\n        occasion when problems arise with a monthly report, Lora Kutkat\n        will always contact the awardee.\n4.  Quarterly:\n    1.  Each team still produces the expected quarterly financial\n        reports. Lora Kutkat no longer needs progress reported there,\n        and you should work out the financial matters with Teresa\n        Marquette. If the narrative is provided to satisfy the\n        scientific progress report, Lora no longer needs that.\n    2.  The team’s business office will send the report to Teresa\n        Marquette and Lora Kutkat.\n    3.  Due date is 30 days following each calendar quarter.\n    4.  When the quarterly report has been accepted by NIH, Teresa tends\n        to let your business office know but problems will always\n        trigger a message to the business office.\n5.  Live Demos:\n    1.  For NHLBI Data Stage, we are likely to have quarterly live demos\n        per group. In the Full Stack group we’ll coordinate between full\n        stacks for the demos we can give on the same quarter\n"}