{
    "id": "54b2d74a653ef566a4f95802def0d6f556e7a4b7",
    "kind": "markdown",
    "created_time": null,
    "modified_time": null,
    "indexed_time": "2019-02-01 23:12:13.875950",
    "title": ".md",
    "url": "https://github.com/chicken/waffles/blob/master/reporting/README.md",
    "mimetype": "",
    "owner_email": "",
    "owner_name": "",
    "group": "",
    "repo_name": "chicken/waffles",
    "repo_url": "https://github.com/chicken/waffles",
    "github_user": "",
    "issue_title": "",
    "issue_url": "",
    "content": "# THE STORY OF GERM LIFE: CHAPTER I: BACTERIA AS PLANTS\n\nDuring the last fifteen years the subject of bacteriology has developed with a marvellous rapidity. At the beginning of the...\n\n## HISTORICAL.\n\nThe study of bacteria practically began with the use of the microscope. It was toward the close of the seventeenth century that...\n\nNothing of importance came from this work, however, partly because of the inadequacy of the microscopes of the day, and...\n\nIt was Louis Pasteur who brought bacteria to the front, and it was by his labours that these organisms were rescued from the...\n\nAfter the importance of the subject had been demonstrated by Pasteur, others turned their attention in the same direction...\n\nThe last fifteen years have, however, seen a wonderful change. The difficulties had been mostly those of methods of work, and...\n\n## WHAT ARE BACTERIA?\n\nThe most interesting facts connected with the subject of bacteriology concern the powers and influence in Nature possessed by...\n\n## FORM OF BACTERIA.\n\nIn shape bacteria are the simplest conceivable structures. Although there are hundreds of different species, they have only three...\n\nIn size there is some variation, though not very great. All are extremely minute, and never visible to the naked eye. The spheres vary...\n\nIn their method of growth we find one of the most characteristic features. They universally have the power of...\n\nWhile all bacteria thus multiply by division, certain differences in the details produce rather striking differences...\n\nThe rod-shaped bacteria also differ somewhat, but to a less extent. They almost always divide in a plane at right angles to their...\n\n## RAPIDITY OF MULTIPLICATION.\n\nIt is this power of multiplication by division that makes bacteria agents of such significance. Their minute size would make...\n\nThis wonderful power of growth is chiefly due to the fact that bacteria feed upon food which is highly organized and already...\n"
}
